app/controllers/activations_controller.rb

  def new
    @account = Account.find_using_perishable_token(params[:activation_code], 1.week)
---
SELECT * FROM `accounts` WHERE (perishable_token = 'O-vVtTYrKbg6qHFKVW56' and updated_at > '2010-02-18 20:55:17') LIMIT 1